kufirre/sensecap-smartbin/sdkconfig.defaults
# SenseCap SmartBin v2.0 Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Application Configuration
CONFIG_WIFI_SSID="myssid"
CONFIG_WIFI_PASSWORD="mypassword"
CONFIG_POSTCODE="SW1A 1AA"

# HTTP Client Configuration
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# I2C Driver Configuration - Match working example (use legacy driver)
# CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK is not set
# CONFIG_I2C_ISR_IRAM_SAFE is not set  
# CONFIG_I2C_ENABLE_SLAVE_DRIVER_VERSION_2 is not set
# I2C Driver Configuration - Use new I2C driver only
CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK=y
CONFIG_I2C_ISR_IRAM_SAFE=y
# Use I2C slave driver v2.0 (recommended, v1.0 will be removed in IDF v6.0)
CONFIG_I2C_ENABLE_SLAVE_DRIVER_VERSION_2=y
# MbedTLS Configuration - Enable DTLS for peer connections
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

# LCD and LVGL performance/stability tuning
# Reduce SPI DMA transfer size and LVGL flush chunk size to avoid SPI queue failures
CONFIG_BSP_LCD_SPI_DMA_SIZE_DIV=16
CONFIG_BSP_LCD_PANEL_SPI_TRANS_Q_DEPTH=1
CONFIG_LVGL_DRAW_BUFF_HEIGHT=120